In [17]:
import pandas as pd

In [18]:
df = pd.read_csv('data.csv', encoding='CP949')

In [36]:
df.sample(n=5)

              name            tel     area
67           핸즈레시피  070-7808-4862  전포대로건너편
16        Red Door   051-633-5255     아바니몰
43             연옥정   051-645-8310      범내골
4               곤국  010-2608-6586  전포대로건너편
32  양산도 히츠마부시 서면본점   051-803-1092       서면

In [34]:
df.loc[df["area"]=='전포역'].sample(n=5)

       name            tel area
23      정식당   051-803-1311  전포역
27  1984나폴리   051-816-1984  전포역
37    은화수식당  070-7361-8141  전포역
18     아임타이  070-8873-1324  전포역
17    루암밋타이   051-804-6585  전포역